### Terraform `plan` Succeeded for Workspace: `staging`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.deploy.data.dns_a_record_set.api_ip will be read during apply
  # (config refers to values not yet known)
 <= data "dns_a_record_set" "api_ip" {
+       addrs = (known after apply)
+       host  = (known after apply)
+       id    = (known after apply)
    }

  # module.deploy.data.dns_a_record_set.web_ip will be read during apply
  # (config refers to values not yet known)
 <= data "dns_a_record_set" "web_ip" {
+       addrs = (known after apply)
+       host  = (known after apply)
+       id    = (known after apply)
    }

  # module.deploy.azurerm_app_service_certificate_binding.web will be created
+   resource "azurerm_app_service_certificate_binding" "web" {
+       app_service_name    = (known after apply)
+       certificate_id      = (known after apply)
+       hostname            = (known after apply)
+       hostname_binding_id = (known after apply)
+       id                  = (known after apply)
+       ssl_state           = "SniEnabled"
+       thumbprint          = (known after apply)
    }

  # module.deploy.azurerm_app_service_connection.api_to_db will be created
+   resource "azurerm_app_service_connection" "api_to_db" {
+       app_service_id     = (known after apply)
+       client_type        = "nodejs"
+       id                 = (known after apply)
+       name               = "cloud_fp_staging_api_to_db"
+       target_resource_id = (known after apply)

+       authentication {
+           name   = (sensitive value)
+           secret = (sensitive value)
+           type   = "secret"
        }
    }

  # module.deploy.azurerm_app_service_custom_hostname_binding.web will be created
+   resource "azurerm_app_service_custom_hostname_binding" "web" {
+       app_service_name    = "cloud-fp-staging-web"
+       hostname            = "staging.cloud.berkeli.co.uk"
+       id                  = (known after apply)
+       resource_group_name = "Cloud-Final-Project-staging"
+       ssl_state           = (known after apply)
+       thumbprint          = (known after apply)
+       virtual_ip          = (known after apply)
    }

  # module.deploy.azurerm_app_service_managed_certificate.web will be created
+   resource "azurerm_app_service_managed_certificate" "web" {
+       canonical_name             = (known after apply)
+       custom_hostname_binding_id = (known after apply)
+       expiration_date            = (known after apply)
+       friendly_name              = (known after apply)
+       host_names                 = (known after apply)
+       id                         = (known after apply)
+       issue_date                 = (known after apply)
+       issuer                     = (known after apply)
+       subject_name               = (known after apply)
+       thumbprint                 = (known after apply)
    }

  # module.deploy.azurerm_linux_web_app.api will be created
+   resource "azurerm_linux_web_app" "api" {
+       app_settings                      = (known after apply)
+       client_affinity_enabled           = false
+       client_certificate_enabled        = false
+       client_certificate_mode           = "Required"
+       custom_domain_verification_id     = (sensitive value)
+       default_hostname                  = (known after apply)
+       enabled                           = true
+       https_only                        = false
+       id                                = (known after apply)
+       key_vault_reference_identity_id   = (known after apply)
+       kind                              = (known after apply)
+       location                          = "westeurope"
+       name                              = "cloud-fp-staging-api"
+       outbound_ip_address_list          = (known after apply)
+       outbound_ip_addresses             = (known after apply)
+       possible_outbound_ip_address_list = (known after apply)
+       possible_outbound_ip_addresses    = (known after apply)
+       resource_group_name               = "Cloud-Final-Project-staging"
+       service_plan_id                   = (known after apply)
+       site_credential                   = (known after apply)
+       zip_deploy_file                   = (known after apply)

+       auth_settings {
+           additional_login_parameters    = (known after apply)
+           allowed_external_redirect_urls = (known after apply)
+           default_provider               = (known after apply)
+           enabled                        = (known after apply)
+           issuer                         = (known after apply)
+           runtime_version                = (known after apply)
+           token_refresh_extension_hours  = (known after apply)
+           token_store_enabled            = (known after apply)
+           unauthenticated_client_action  = (known after apply)

+           active_directory {
+               allowed_audiences          = (known after apply)
+               client_id                  = (known after apply)
+               client_secret              = (sensitive value)
+               client_secret_setting_name = (known after apply)
            }

+           facebook {
+               app_id                  = (known after apply)
+               app_secret              = (sensitive value)
+               app_secret_setting_name = (known after apply)
+               oauth_scopes            = (known after apply)
            }

+           github {
+               client_id                  = (known after apply)
+               client_secret              = (sensitive value)
+               client_secret_setting_name = (known after apply)
+               oauth_scopes               = (known after apply)
            }

+           google {
+               client_id                  = (known after apply)
+               client_secret              = (sensitive value)
+               client_secret_setting_name = (known after apply)
+               oauth_scopes               = (known after apply)
            }

+           microsoft {
+               client_id                  = (known after apply)
+               client_secret              = (sensitive value)
+               client_secret_setting_name = (known after apply)
+               oauth_scopes               = (known after apply)
            }

+           twitter {
+               consumer_key                 = (known after apply)
+               consumer_secret              = (sensitive value)
+               consumer_secret_setting_name = (known after apply)
            }
        }

+       site_config {
+           always_on                               = true
+           container_registry_use_managed_identity = false
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           ftps_state                              = "Disabled"
+           health_check_eviction_time_in_min       = (known after apply)
+           health_check_path                       = "/v1"
+           http2_enabled                           = false
+           ip_restriction                          = [
+               {
+                   action                    = (known after apply)
+                   headers                   = null
+                   ip_address                = (known after apply)
+                   name                      = (known after apply)
+                   priority                  = (known after apply)
+                   service_tag               = null
+                   virtual_network_subnet_id = null
                },
            ]
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           local_mysql_enabled                     = false
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.2"
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_ip_restriction                      = (known after apply)
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = true
+           vnet_route_all_enabled                  = false
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               node_version = "16-lts"
            }
        }
    }

  # module.deploy.azurerm_linux_web_app.web will be created
+   resource "azurerm_linux_web_app" "web" {
+       app_settings                      = {
+           "API_URL"                             = "https://cloud-fp-staging-api.azurewebsites.net/v1"
+           "WEBSITES_ENABLE_APP_SERVICE_STORAGE" = "false"
+           "WEBSITES_PORT"                       = "3000"
        }
+       client_affinity_enabled           = false
+       client_certificate_enabled        = false
+       client_certificate_mode           = "Required"
+       custom_domain_verification_id     = (sensitive value)
+       default_hostname                  = (known after apply)
+       enabled                           = true
+       https_only                        = false
+       id                                = (known after apply)
+       key_vault_reference_identity_id   = (known after apply)
+       kind                              = (known after apply)
+       location                          = "westeurope"
+       name                              = "cloud-fp-staging-web"
+       outbound_ip_address_list          = (known after apply)
+       outbound_ip_addresses             = (known after apply)
+       possible_outbound_ip_address_list = (known after apply)
+       possible_outbound_ip_addresses    = (known after apply)
+       resource_group_name               = "Cloud-Final-Project-staging"
+       service_plan_id                   = (known after apply)
+       site_credential                   = (known after apply)
+       zip_deploy_file                   = (known after apply)

+       auth_settings {
+           additional_login_parameters    = (known after apply)
+           allowed_external_redirect_urls = (known after apply)
+           default_provider               = (known after apply)
+           enabled                        = (known after apply)
+           issuer                         = (known after apply)
+           runtime_version                = (known after apply)
+           token_refresh_extension_hours  = (known after apply)
+           token_store_enabled            = (known after apply)
+           unauthenticated_client_action  = (known after apply)

+           active_directory {
+               allowed_audiences          = (known after apply)
+               client_id                  = (known after apply)
+               client_secret              = (sensitive value)
+               client_secret_setting_name = (known after apply)
            }

+           facebook {
+               app_id                  = (known after apply)
+               app_secret              = (sensitive value)
+               app_secret_setting_name = (known after apply)
+               oauth_scopes            = (known after apply)
            }

+           github {
+               client_id                  = (known after apply)
+               client_secret              = (sensitive value)
+               client_secret_setting_name = (known after apply)
+               oauth_scopes               = (known after apply)
            }

+           google {
+               client_id                  = (known after apply)
+               client_secret              = (sensitive value)
+               client_secret_setting_name = (known after apply)
+               oauth_scopes               = (known after apply)
            }

+           microsoft {
+               client_id                  = (known after apply)
+               client_secret              = (sensitive value)
+               client_secret_setting_name = (known after apply)
+               oauth_scopes               = (known after apply)
            }

+           twitter {
+               consumer_key                 = (known after apply)
+               consumer_secret              = (sensitive value)
+               consumer_secret_setting_name = (known after apply)
            }
        }

+       site_config {
+           always_on                               = true
+           container_registry_use_managed_identity = false
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           ftps_state                              = "Disabled"
+           health_check_eviction_time_in_min       = (known after apply)
+           health_check_path                       = "/api/healthz"
+           http2_enabled                           = false
+           ip_restriction                          = (known after apply)
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           local_mysql_enabled                     = false
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.2"
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_ip_restriction                      = (known after apply)
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = true
+           vnet_route_all_enabled                  = false
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               node_version = "16-lts"
            }
        }
    }

  # module.deploy.azurerm_monitor_diagnostic_setting.api will be created
+   resource "azurerm_monitor_diagnostic_setting" "api" {
+       id                 = (known after apply)
+       name               = "cloud-fp-staging-api-logs"
+       storage_account_id = (known after apply)
+       target_resource_id = (known after apply)

+       log {
+           category = "AppServiceConsoleLogs"
+           enabled  = true

+           retention_policy {
+               days    = 7
+               enabled = true
            }
        }
+       log {
+           category = "AppServiceHTTPLogs"
+           enabled  = true

+           retention_policy {
+               days    = 7
+               enabled = true
            }
        }

+       metric {
+           category = "AllMetrics"
+           enabled  = true

+           retention_policy {
+               days    = 3
+               enabled = false
            }
        }
    }

  # module.deploy.azurerm_monitor_diagnostic_setting.web will be created
+   resource "azurerm_monitor_diagnostic_setting" "web" {
+       id                 = (known after apply)
+       name               = "cloud-fp-staging-web-logs"
+       storage_account_id = (known after apply)
+       target_resource_id = (known after apply)

+       log {
+           category = "AppServiceConsoleLogs"
+           enabled  = true

+           retention_policy {
+               days    = 7
+               enabled = true
            }
        }
+       log {
+           category = "AppServiceHTTPLogs"
+           enabled  = true

+           retention_policy {
+               days    = 7
+               enabled = true
            }
        }

+       metric {
+           category = "AllMetrics"
+           enabled  = true

+           retention_policy {
+               enabled = false
            }
        }
    }

  # module.deploy.azurerm_postgresql_database.this will be created
+   resource "azurerm_postgresql_database" "this" {
+       charset             = "utf8"
+       collation           = "English_United States.1252"
+       id                  = (known after apply)
+       name                = "database"
+       resource_group_name = "Cloud-Final-Project-staging"
+       server_name         = "cloud-fp-staging"
    }

  # module.deploy.azurerm_postgresql_firewall_rule.this will be created
+   resource "azurerm_postgresql_firewall_rule" "this" {
+       end_ip_address      = (known after apply)
+       id                  = (known after apply)
+       name                = "api"
+       resource_group_name = "Cloud-Final-Project-staging"
+       server_name         = "cloud-fp-staging"
+       start_ip_address    = (known after apply)
    }

  # module.deploy.azurerm_postgresql_server.this will be created
+   resource "azurerm_postgresql_server" "this" {
+       administrator_login              = (sensitive value)
+       administrator_login_password     = (sensitive value)
+       auto_grow_enabled                = false
+       backup_retention_days            = 7
+       create_mode                      = "Default"
+       fqdn                             = (known after apply)
+       geo_redundant_backup_enabled     = false
+       id                               = (known after apply)
+       location                         = "westeurope"
+       name                             = "cloud-fp-staging"
+       public_network_access_enabled    = true
+       resource_group_name              = "Cloud-Final-Project-staging"
+       sku_name                         = "B_Gen5_1"
+       ssl_enforcement_enabled          = true
+       ssl_minimal_tls_version_enforced = "TLS1_2"
+       storage_mb                       = 5120
+       version                          = "11"
    }

  # module.deploy.azurerm_service_plan.api will be created
+   resource "azurerm_service_plan" "api" {
+       id                           = (known after apply)
+       kind                         = (known after apply)
+       location                     = "westeurope"
+       maximum_elastic_worker_count = (known after apply)
+       name                         = "cloud-fp-staging-api"
+       os_type                      = "Linux"
+       per_site_scaling_enabled     = false
+       reserved                     = (known after apply)
+       resource_group_name          = "Cloud-Final-Project-staging"
+       sku_name                     = "B1"
+       worker_count                 = (known after apply)
    }

  # module.deploy.azurerm_service_plan.web will be created
+   resource "azurerm_service_plan" "web" {
+       id                           = (known after apply)
+       kind                         = (known after apply)
+       location                     = "westeurope"
+       maximum_elastic_worker_count = (known after apply)
+       name                         = "cloud-fp-staging-web"
+       os_type                      = "Linux"
+       per_site_scaling_enabled     = false
+       reserved                     = (known after apply)
+       resource_group_name          = "Cloud-Final-Project-staging"
+       sku_name                     = "B1"
+       worker_count                 = (known after apply)
    }

  # module.deploy.azurerm_storage_account.this will be created
+   resource "azurerm_storage_account" "this" {
+       access_tier                       = (known after apply)
+       account_kind                      = "StorageV2"
+       account_replication_type          = "LRS"
+       account_tier                      = "Standard"
+       allow_nested_items_to_be_public   = true
+       cross_tenant_replication_enabled  = true
+       default_to_oauth_authentication   = false
+       enable_https_traffic_only         = true
+       id                                = (known after apply)
+       infrastructure_encryption_enabled = false
+       is_hns_enabled                    = false
+       large_file_share_enabled          = (known after apply)
+       location                          = "westeurope"
+       min_tls_version                   = "TLS1_2"
+       name                              = "cloudfpstaginglogs"
+       nfsv3_enabled                     = false
+       primary_access_key                = (sensitive value)
+       primary_blob_connection_string    = (sensitive value)
+       primary_blob_endpoint             = (known after apply)
+       primary_blob_host                 = (known after apply)
+       primary_connection_string         = (sensitive value)
+       primary_dfs_endpoint              = (known after apply)
+       primary_dfs_host                  = (known after apply)
+       primary_file_endpoint             = (known after apply)
+       primary_file_host                 = (known after apply)
+       primary_location                  = (known after apply)
+       primary_queue_endpoint            = (known after apply)
+       primary_queue_host                = (known after apply)
+       primary_table_endpoint            = (known after apply)
+       primary_table_host                = (known after apply)
+       primary_web_endpoint              = (known after apply)
+       primary_web_host                  = (known after apply)
+       public_network_access_enabled     = true
+       queue_encryption_key_type         = "Service"
+       resource_group_name               = "Cloud-Final-Project-staging"
+       secondary_access_key              = (sensitive value)
+       secondary_blob_connection_string  = (sensitive value)
+       secondary_blob_endpoint           = (known after apply)
+       secondary_blob_host               = (known after apply)
+       secondary_connection_string       = (sensitive value)
+       secondary_dfs_endpoint            = (known after apply)
+       secondary_dfs_host                = (known after apply)
+       secondary_file_endpoint           = (known after apply)
+       secondary_file_host               = (known after apply)
+       secondary_location                = (known after apply)
+       secondary_queue_endpoint          = (known after apply)
+       secondary_queue_host              = (known after apply)
+       secondary_table_endpoint          = (known after apply)
+       secondary_table_host              = (known after apply)
+       secondary_web_endpoint            = (known after apply)
+       secondary_web_host                = (known after apply)
+       sftp_enabled                      = false
+       shared_access_key_enabled         = true
+       table_encryption_key_type         = "Service"
+       tags                              = {
+           "environment" = "staging"
        }

+       blob_properties {
+           change_feed_enabled           = (known after apply)
+           change_feed_retention_in_days = (known after apply)
+           default_service_version       = (known after apply)
+           last_access_time_enabled      = (known after apply)
+           versioning_enabled            = (known after apply)

+           container_delete_retention_policy {
+               days = (known after apply)
            }

+           cors_rule {
+               allowed_headers    = (known after apply)
+               allowed_methods    = (known after apply)
+               allowed_origins    = (known after apply)
+               exposed_headers    = (known after apply)
+               max_age_in_seconds = (known after apply)
            }

+           delete_retention_policy {
+               days = (known after apply)
            }

+           restore_policy {
+               days = (known after apply)
            }
        }

+       network_rules {
+           bypass                     = (known after apply)
+           default_action             = (known after apply)
+           ip_rules                   = (known after apply)
+           virtual_network_subnet_ids = (known after apply)

+           private_link_access {
+               endpoint_resource_id = (known after apply)
+               endpoint_tenant_id   = (known after apply)
            }
        }

+       queue_properties {
+           cors_rule {
+               allowed_headers    = (known after apply)
+               allowed_methods    = (known after apply)
+               allowed_origins    = (known after apply)
+               exposed_headers    = (known after apply)
+               max_age_in_seconds = (known after apply)
            }

+           hour_metrics {
+               enabled               = (known after apply)
+               include_apis          = (known after apply)
+               retention_policy_days = (known after apply)
+               version               = (known after apply)
            }

+           logging {
+               delete                = (known after apply)
+               read                  = (known after apply)
+               retention_policy_days = (known after apply)
+               version               = (known after apply)
+               write                 = (known after apply)
            }

+           minute_metrics {
+               enabled               = (known after apply)
+               include_apis          = (known after apply)
+               retention_policy_days = (known after apply)
+               version               = (known after apply)
            }
        }

+       routing {
+           choice                      = (known after apply)
+           publish_internet_endpoints  = (known after apply)
+           publish_microsoft_endpoints = (known after apply)
        }

+       share_properties {
+           cors_rule {
+               allowed_headers    = (known after apply)
+               allowed_methods    = (known after apply)
+               allowed_origins    = (known after apply)
+               exposed_headers    = (known after apply)
+               max_age_in_seconds = (known after apply)
            }

+           retention_policy {
+               days = (known after apply)
            }

+           smb {
+               authentication_types            = (known after apply)
+               channel_encryption_type         = (known after apply)
+               kerberos_ticket_encryption_type = (known after apply)
+               multichannel_enabled            = (known after apply)
+               versions                        = (known after apply)
            }
        }
    }

Plan: 14 to add, 0 to change, 0 to destroy.
```
</details>